//1 - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
let time = +prompt('від 0 до 59');
if (time >= 0 && time <= 15){
    console.log('first');
}else if(time > 15 && time < 30){
    console.log('second');
}else if(time>= 30 && time <= 45){
    console.log('thirt');
}else if(time >45 && time <=59){
    console.log('foutrh');
}
// ******************************************
//2 - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
let day = +prompt(' від 1 до 31');
day >= 1 && day <=10 ? console.log('first') : day >= 11 && day <=20 ? console.log('second') :day >= 11 && day <=31 ? console.log('thirt') : 'none';
// ******************************************
//3 - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
let test = 'thoipiopio';
if (typeof test !== true ){
    console.log('Вірно');
}else {
    console.log('Неправильно');//не зрозумів чому th це не ТРУ
}

let test1 = 'th';
test1 === !true ? console.log('Вірно') : console.log('Неправильно');//не зрозумів чому th це не ТРУ( спеціально !true поставив для перевірки )
//************************************************
// 4 - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
let a = 1;
if ( a !== 0){
    console.log('Вірно');
}else{
    console.log('Невірно');
}

a !== 0 ? console.log('Вірно') : console.log('Невірно');
//****************************************************
//5 - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
let number = 3;
switch (number) {
    case 1:
        console.log("work");
        break;
    case 2:
        console.log("study");
        break;
    case 3:
        console.log("stady and work");
        break;
}
//6 - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
let year = prompt('');
if ( year % 4 === 0){
    document.write("leap");
}else{
    document.write("standart");
}
//****************************************************
// 7- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
let namejs = 'ECMAScript';
let variant = prompt('Яка «офіційна» назва JavaScript?');
if (variant === namejs){
    document.write('Правильно');
}else {
    document.write('Не знаєте? ECMAScript!');
}
//****************************************************NEXT__CW//****************************************************
//****************************************************NEXT__CW//****************************************************
//1  - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
let d = prompt('num1');
let c = prompt('num2');
if (d > c){
    document.write('Перше правильно');
}else if
     (c > d){
        document.write('Друге правильно');
}else {
    document.write('Обидва рівні');
}
//другий спосіб
d > c ? document.write('Перше правильно') : c > d ? document.write('Друге правильно') : document.write('Обидва рівні');
//******************************************************************
// 2 - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let numberdoor = +prompt('Номер квартиры')
let firstp = "Первый подьезд";
let secondp = "Второй подьезд";
let thirtp = "Третий подьезд";
if (numberdoor >= 1 && numberdoor<= 20){
    document.write(`${firstp}`);
}else if (numberdoor >= 21 && numberdoor<= 48){
    document.write(`${secondp}`);
}else if (numberdoor >= 49 && numberdoor<= 90){
    document.write(`${thirtp}`);
}else {
    document.write('Другой дом');
}
//***************************************************************************************
///3- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let numberperson = +prompt('числове значення');
// //1 спосіб
numberperson === 10 ? document.write('ВІРНО') : document.write('ВІРНО');
//2 спосіб
if (numberperson === 10){
    document.write('ВІРНО');
}else if (numberperson !== 10){
    document.write('NOВІРНО');
}///ну і елсе там ще щось...
//***************************************************************************************
//4- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
let x = 'sdfg';
if ( typeof x === 'number'){
   console.log('1');
}else if ( typeof x === 'string') {
    console.log('2');
}else if ( typeof x === 'boolean') {
    console.log('3');
}else if ( typeof x === 'object'){
    console.log('4');
}else {
    console.log('записали щось інше');
}
//************************************************************************************************
// 5- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
let degree = 10;
degree >= 10 && degree <= 22 ? document.write('ofline') : document.write('ONline');
// *********************************************************************************************
// 6 - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
let game = +prompt('число від 1 до 5') ;
switch (game) {
    case 1:
        console.log("auto");
        break;
    case 2:
        console.log("moto");
        break;
    case 3:
        console.log("mob");
        break;
    case 4:
        console.log("home");
        break;
    case 5:
        console.log("book");
        break;
}
// *********************************************************************************************
// additional
// additional
// // additional
// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if(friends.length >= 3){
    document.write('великий масив, в якому  3 і більше елементи.');
}else{
    document.write('маленький масив, в якому менше 3-х елементів.');
}

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.







// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

//a + b < 4 ? result = 'Мало': result = 'Багато';

let ap = 1;
let bp = 2;
ap + bp < 4 ? console.log('Мало') : console.log('Багато');


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let minuus = -100;
let pluus = 100
let pluusminuus = 0;

if ()
