// 1. Створити пустий масив та :
//     a. заповнити його 50 парними числами за допомоги циклу.
//     b. заповнити його 50 непарними числами за допомоги циклу.
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
// 2. Вивести за допомогою console.log кожен третій елемен
// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//
// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.



// 1. Створити пустий масив та :
//     a. заповнити його 50 парними числами за допомоги циклу.
let arr = [];
for (let i = 0; i <= 50; i++) {
    if([i] % 2 === 0 ){
        arr[i] = i + 2;
        document.write(`<div> ${[i]}</div>`)
    }
}
//     b. заповнити його 50 непарними числами за допомоги циклу.
let arrr = [];
for (let i = 0; i <= 50; i++) {
    if([i] % 2 !== 0 ){
        arrr[i] = i + 2;
        document.write(`<div> ${[i]}</div>`)
    }
}
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
let m = [];
for (let m1 = 0; m1<20; m1++){
    let m1 = Math.round(Math.random() * 100);
    document.write(`${m1}`);
}
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
let m2 = [];
for (let m1 = 0; m1<20; m1++){
    let m1 = Math.round(Math.random(8) * 732);
    document.write(`<div>${m1}</div> `);
}
// 2. Вивести за допомогою console.log кожен третій елемен
let m3 = [22,32,44,55,55,23,25,99];
for ( let i = 0; i < m3.length; i++){
    if ([i] % 3 === 0 ){
        console.log(m3[i]);
    }
}
// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
let m4 = [22,32,44,55,55,23,25,99];
for ( let i = 0; i < m4.length; i++){
    if ([i] % 3 === 0 && m4[i] % 2 ===0 ){
        console.log(m4[i]);
    }
}
//4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
// let m5 = [22,32,44,55,55,23,25,99];
// let m6 = [];
// for ( let i = 0; i < m5.length; i++){
//     if([i]% 3 ===0 && m5[i]%2===0){
//         m5[i]===m6[i];
//         console.log(m5[i],m6[i]);
//
//     }
// }
let m5 = [22,32,44,55,55,23,25,99];
let m6 = [];
for ( let i = 0; i < m5.length; i+=3){
    if (m5[i]%2===0){
        m6[i]=m5[i]
        console.log(m5[i],m6[i]);
    }
}
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56