// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
let workerr = [123,345,567,678,8910];
let worker = ['Петров', 'Иванов', 'Васильев', 'Яковлева', 'Степанова'];
let www = ['Петров', 'Иванов', 'Васильев', 'Яковлева', 'Степанова',123,345,567,678,8910, !!0,!!2, true, false, !!'hu'];
console.log(www);
//****************************
//-- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
let wempty = ['empty',345,'noempty',678,8910];
console.log(wempty[2]);
//****************************
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
for ( let i = 0; i < 10; i ++){
    document.write(`<div>asdasd</div> `);
}
//- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
for ( let i = 1; i < 11; i ++){
    document.write(`<div>asdasd ${i}</div>` );
}
//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
let i = 0;
while ( i < 20 ){
    document.write(`<h1>ADADAD</h1>`);
    i++;
}
//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
let io = 0;
while ( io < 20){
    document.write(`<h1>20 ${io}</h1>`);
    io++;
}
//- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
let mas1 = [12,23,34,45,56,67,78,89,910,11];
for (let i=0; i< mas1.length; i++){
    console.log(mas1[i]);
}
//- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
let mas2 = ['qw','qw','we','we','er','er','rt','rt','ty','ty'];
for (let i=0; i<mas2.length; i++){
    console.log(mas2[i]);
}
//- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
let mas3 = ['qwe',213,'qw',34,234,234,11,'1d',1,10];
for( let i = 0; i<mas3.length; i++){
    console.log(mas3[i]);
}
//- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
let mas4 = [123,'qwe',!!'bol',122,65,true,'bgt',2,4,10];
for ( let i=0; i<mas4.length;i++){
    if(typeof mas4[i] === 'boolean'){
        document.write(`<div> ${mas4[i]} </div>`);
        console.log(mas4[i]);
    }
}
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
let mas5 = [123,'qwe',!!'bol',122,65,true,'bgt',2,4,10];
for (  let i = 0; i<mas5.length; i++){
    if( typeof mas5[i]=== 'number'){
        console.log(mas5[i]);
    }
}
//- Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
let mas6 = [123,'qwe',!!'bol',122,65,true,'bgt',2,4,10];
for (let i = 0; i < mas6.length; i++){
    if (typeof mas6[i]==='string'){
        console.log(mas6[i]);
    }
}
//- Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
let arrempty = [];
arrempty[0] = 123;
arrempty[1] = 1222;
arrempty[2] = true;
arrempty[3] = 'dert';
for ( let i = 0; i < arrempty.length; i++){
    console.log(arrempty[i]);
}
//- Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
for ( let i= 0; i < 10; i++){
    document.write([i]);
}
//- Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
for ( let i =0; i < 100; i++){
    document.write(`<div>${[i]} </div>`);
}
//- Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
for ( let i =0; i < 100; i+=2){
    document.write(`<div>${[i]} </div>`);
}
//- Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
for ( let i =0; i < 100; i+=2){
    document.write(`<div>${[i]} </div>`);
    console.log(i);
}
//- Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
for ( let i =0; i < 100; i+=3){
    document.write(`<div>${[i]} </div>`);
    console.log(i);
}